{
    "fileName": "over-engineering.html",
    "title": "Over engineering",
    "scripts": [
        "https://cdn.tailwindcss.com"
    ],
    "header": {
        "title": "How I over-engineered my landing page",
        "type": "normal",
        "content": "My landing page (and this article) is generated by small program that takes in json and outputs html files. In this article I outline why and how I achieved this."
    },
    "body": [
        {
            "title": "Why",
            "content": [
                {
                    "type": "normal",
                    "title": "",
                    "content": "I've definitely encountered Github profiles or landing pages that made me think, 'Wow, this looks great! I should put some time into my own.' I then quickly run into a topic I personally dread, frontend developement. I have tried writing UIs in a bunch of different languages but they all end up with the same issues, they look like a 3 year old got their hands on a permanent marker they were not supposed to have."
                },
                {
                    "type": "normal",
                    "title": "",
                    "content": "After not rly seeing a clear direction I wanted to go in I started listing things that would make me a more well rounded developer; Frontend quickly became number 1 on that list. I decided to just bite the bullet and make a personal landing page to kill 2 birds with 1 stone."
                },
                {
                    "type": "normal",
                    "title": "",
                    "content": "After looking at using react or vue I realized that those frameworks are used to handle interaction and state on the client side. This article and the landing page are both just static content so there is no real need for anything beyond the interaction your browser already provides. I initially landed on the idea of just writing an html file with the content stuff I wanted to link to it. But what if I wanted to update my landing page dynamically?"
                }
            ]
        },
        {
            "title": "How",
            "content": [
                {
                    "type": "normal",
                    "title": "",
                    "content": "I made a list of requirements for the \"system\" I wanted to build. Something I could dynamically update the page and for simplicity's sake I also wanted to deploy it automatically on AWS since I have experience with that."
                },
                {
                    "type": "normal",
                    "title": "",
                    "content": "The plan was to generate html files based on data files. The 2 options I had to choose between were Rust with Clap or Golang with Templ, both options would have a missing piece. I initially choose for Rust and Clap since I find Clap easier to organize compared to Cobra which is the Golang defacto standard cli library. After some hacking around I decided to go with Golang and Templ anyway since I could not find an html templating library for rust that was not attached to a webserver framework. Besides the development part, I just decided to go the easy route and deploy the files on AWS CloudFront backed by files in an S3 bucket that would be updated on a git tag with Github actions. So the stack ends up looking like this:"
                },
                {
                    "type": "normal",
                    "title": "",
                    "content": "Golang, Templ and Cobra for the development"
                },
                {
                    "type": "normal",
                    "title": "",
                    "content": "AWS S3, CloudFront and Github actions for the deployment"
                }
            ]
        },
        {
            "title": "Would I do this again",
            "content": [
                {
                    "type": "normal",
                    "title": "",
                    "content": "The short answer is yes, I definitely would."
                },
                {
                    "type": "normal",
                    "title": "",
                    "content": "The long answer is still yes, but maybe I would just start hacking earlier. After I was almost happy with the files I was able to generate, I felt like I spent too much time over-designing and over-engineering a solution that would tick all the boxes. But at least now I can write html pages in json LOL"
                }
            ]
        }
    ],
    "footer": {
        "type": "normal",
        "title": "",
        "content": "<a href=\"https://mitchell.berendhuysen.nl\"><p class=\"text-blue-500 hover:text-blue-700 hover:underline\">home</p></a>",
        "link": ""
    },
    "sidePanel": [
        {
            "title": "",
            "link": "https://www.github.com/MitchellBerend",
            "image": "https://img.shields.io/badge/%20-MitchellBerend-blue?style=for-the-badge&logo=github&logoColor=black"
        }
    ]
}
